#+TITLE: Algorithm On Leetcode<Array> 1 (Easy Level)
#+DATE: <2020-08-27 15:34:19>
#+TAGS[]: algorithm, leetcode, programming, javascript, array
#+CATEGORIES[]: algorithm, array
#+LANGUAGE: zh-cn
#+OPTIONS: ^:{} _:{}
#+STARTUP: indent

#+BEGIN_EXPORT html
基于 leetcode 的算法学习记录文章，使用语言主要是 JavaScript，可能会有少于 C/Python 实现，在没标明的情况下默认都是 JavaScript 实现。<br><br>
约定 ：<br>

1. 有<sup><font color="red" size="2">每日</font></sup> 角标的标识是每日一题的题目 <br>
2. 有<sup><font color="red" size="2">leetcode</font></sup>角标的标识是该方案是Leetcode 网站上的题解 <br>

#+END_EXPORT

** 方案一： reduce + Object.keys + map + filter
   下面这种方案适合于将所有重复的数字都找出来的案例，如果只需要找到第一个，该方案有多余的处理步骤，不建议使用。
   #+begin_src js
     /**
      ,* @param {number[]} nums
      ,* @return {number}
      ,*/
     var findRepeatNumber = function (nums) {
       if (!Array.isArray(nums)) return []

       // 通过 reduce 得到 { val: times } 结果
       // 如果重复出现过 times > 0 否则 times === 0
       let res = nums.reduce((acc, num) => {
         const k = num + ""
         let v = acc[num + ""] || 0
         if (acc.hasOwnProperty(k)) {
           acc[k] = ++v
         } else {
           acc[k] = 0
         }
         return acc
       }, {})

       // 然后通过 keys, map 整理结果 times > 0 的值
       // 最后 filter 过滤掉 0 值得到的数组就是源数组中重复的数集合
       const found = +Object.keys(res)
             .map(k => (res[k] ? k : 0))
             .filter(Boolean)[0]

       return found !== found ? -1 : found
     }

     console.log(findRepeatNumber([2, 3, 1, 0, 2, 5, 3]))
   #+end_src

   #+RESULTS:
   : 2
   : undefined

   *执行结果：*

   @@html:<font color="red">@@执行用时：152 ms, 在所有 JavaScript 提交中击败了 24.41%的用户@@html:</font>@@

   内存消耗：51.9 MB, 在所有 JavaScript 提交中击败了 100.00%的用户

   | 提交时间 | 提交结果 | 运行时间 | 内存消耗 | 语言       |
   |----------+----------+----------+----------+------------|
   | 几秒前   | 通过     | 152 ms   | 51.9 MB  | Javascript |

